wisteria-1c/Конфигурация/InformationRegisters/НДФЛСтандартныеВычетыНаДетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НДФЛСтандартныеВычетыНаДетей</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРожденияРебенка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиСРебенком</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/НДФЛРазмерВычетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НДФЛРазмерВычетов</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеПоДоходам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ГруппыВычетовПоНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ГруппыВычетовПоНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Стандартные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартныеНаДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущественные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Социальные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальныеПоУведомлениюНО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/НДФЛСтандартныеВычетыНаДетей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьОписанияВычетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОписаниеВычета();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодВычетаПриИзменении(Элемент)
	
	ОбновитьОписаниеВычета();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОписанияВычетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыВычетовНДФЛ.ПолноеНаименование КАК ПолноеНаименование,
	               |	ЕСТЬNULL(РазмерВычетовНДФЛСрезПоследних.Размер, 0) КАК Размер,
	               |	ВидыВычетовНДФЛ.Ссылка КАК ВидВычета
	               |ИЗ
	               |	Справочник.ВычетыНДФЛ КАК ВидыВычетовНДФЛ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛРазмерВычетов.СрезПоследних КАК РазмерВычетовНДФЛСрезПоследних
	               |		ПО ВидыВычетовНДФЛ.Ссылка = РазмерВычетовНДФЛСрезПоследних.КодВычета
	               |ГДЕ
	               |	ВидыВычетовНДФЛ.ГруппаВычета = ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.СтандартныеНаДетей)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидыВычетовНДФЛ.Код";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СписокВычетов.Очистить();
	Пока Выборка.Следующий() Цикл
		ОписаниеВычета = Выборка.ПолноеНаименование;
		Если ЗначениеЗаполнено(Выборка.Размер) Тогда
			ОписаниеВычета = СтрШаблон("%1 руб.: %2", Выборка.Размер, ОписаниеВычета);
		КонецЕсли;
    	СписокВычетов.Добавить(Выборка.ВидВычета, ОписаниеВычета);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписаниеВычета()
	
	ОписаниеВычета = "";
	ЭлементВычет = СписокВычетов.НайтиПоЗначению(Запись.КодВычета);
	Если ЭлементВычет <> Неопределено Тогда
		ОписаниеВычета = ЭлементВычет.Представление;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
